package com.gz.xhb.MVP.Presenter;

import com.google.gson.Gson;
import com.google.gson.JsonArray;
import com.google.gson.JsonObject;
import com.google.gson.reflect.TypeToken;
import com.gz.xhb.MVP.Model.API.cache.CacheProviders;
import com.gz.xhb.MVP.Model.Entity.BaseArrayVO;
import com.gz.xhb.MVP.Model.Entity.DataWaterInfo;
import com.gz.xhb.MVP.Model.Entity.Map;
import com.gz.xhb.MVP.Model.WaterDataBiz;
import com.gz.xhb.MVP.Model.ServiceManager;
import com.gz.xhb.MVP.View.OnlineDataView;
import com.gz.xhb.util.MyObserver;

import org.json.JSONArray;
import org.json.JSONException;
import org.json.JSONObject;

import java.util.ArrayList;
import java.util.HashMap;
import java.util.Iterator;
import java.util.List;

import io.reactivex.android.schedulers.AndroidSchedulers;
import io.reactivex.schedulers.Schedulers;
import io.rx_cache2.DynamicKey;
import io.rx_cache2.EvictDynamicKey;
import okhttp3.ResponseBody;


/**
 * Created by xjj on 2018/6/30.
 */

public class OnlineDataPresenter {
    OnlineDataView onlineDataView;
    WaterDataBiz waterBiz;
//    String testWater = "{\"total\":90,\"rows\":[{\"监测时间\":\"2018-07-17 14:50\",\"碳氢化合物实测平均浓度(mg/m3)\":\"55\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 14:40\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 14:30\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 14:20\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 14:10\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 14:00\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 13:50\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 13:40\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 13:30\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 13:20\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 13:10\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 13:00\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 12:50\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 12:40\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 12:30\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 12:20\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 12:10\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 12:00\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 11:50\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 11:40\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 11:30\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 11:20\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 11:10\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 11:00\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 10:50\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 10:40\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 10:30\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 10:20\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 10:10\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 10:00\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 09:50\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 09:40\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 09:30\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 09:20\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 09:10\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 09:00\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 08:50\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 08:40\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 08:30\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 08:20\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 08:10\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 08:00\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 07:50\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 07:40\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 07:30\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 07:20\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 07:10\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 07:00\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 06:50\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 06:40\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 06:30\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 06:20\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 06:10\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 06:00\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 05:50\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 05:40\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 05:30\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 05:20\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 05:10\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 05:00\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 04:50\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 04:40\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 04:30\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 04:20\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 04:10\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 04:00\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 03:50\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 03:40\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 03:30\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 03:20\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 03:10\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 03:00\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 02:50\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 02:40\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 02:30\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 02:20\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 02:10\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 02:00\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 01:50\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 01:40\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 01:30\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 01:20\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 01:10\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 01:00\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 00:50\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 00:40\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 00:30\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 00:20\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 00:10\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"},{\"监测时间\":\"2018-07-17 00:00\",\"碳氢化合物实测平均浓度(mg/m3)\":\"35\",\"碳氢化合物折算平均浓度(mg/m3)\":\"35\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"35\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"35\"}]}";
    String testWater = "{\"total\":90,\"rows\":[{\"监测时间\":\"2018-07-17 14:50\",\"碳氢化合物实测平均浓度(mg/m3)\":\"30\",\"碳氢化合物折算平均浓度(mg/m3)\":\"38\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"34\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"36\"},{\"监测时间\":\"2018-07-17 14:40\",\"碳氢化合物实测平均浓度(mg/m3)\":\"37\",\"碳氢化合物折算平均浓度(mg/m3)\":\"38\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"31\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"33\"},{\"监测时间\":\"2018-07-17 14:30\",\"碳氢化合物实测平均浓度(mg/m3)\":\"37\",\"碳氢化合物折算平均浓度(mg/m3)\":\"44\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"42\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"40\"},{\"监测时间\":\"2018-07-17 14:20\",\"碳氢化合物实测平均浓度(mg/m3)\":\"28\",\"碳氢化合物折算平均浓度(mg/m3)\":\"26\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"24\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"50\"},{\"监测时间\":\"2018-07-17 14:10\",\"碳氢化合物实测平均浓度(mg/m3)\":\"54\",\"碳氢化合物折算平均浓度(mg/m3)\":\"53\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"55\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"54\"},{\"监测时间\":\"2018-07-17 14:00\",\"碳氢化合物实测平均浓度(mg/m3)\":\"51\",\"碳氢化合物折算平均浓度(mg/m3)\":\"33\",\"非甲烷总烃实测平均浓度(mg/m3)\":\"18\",\"非甲烷总烃折算平均浓度(mg/m3)\":\"13\"}]}";



    //    @Inject
    public OnlineDataPresenter(OnlineDataView onlineDataView) {
        this.onlineDataView = onlineDataView;
        waterBiz = new WaterDataBiz();
        onlineDataView.setTimeListener();
    }

    public void getTestData() {
        JSONObject jsonObject = null;
        try {
            jsonObject = new JSONObject(testWater);
            JSONArray jsonArray = jsonObject.getJSONArray("rows");
            onlineDataView.showData(jsonArray);
        } catch (JSONException e) {
            e.printStackTrace();
        }

    }

    ;

    public void getWaterData(String pscode, String outputcode, String datatype, String outputtype, String begintime, String endtime, String pollutantcode) {
        io.reactivex.Observable<ResponseBody> observable = new ServiceManager().getOnlineData(pscode, outputcode, datatype, outputtype, begintime, endtime, pollutantcode);

        CacheProviders.getCache()
                .getOnlineData(observable, new DynamicKey(pscode + outputcode + datatype + outputtype + begintime + endtime + pollutantcode), new EvictDynamicKey(false))
                .subscribeOn(Schedulers.io())
                .observeOn(AndroidSchedulers.mainThread())
                .subscribe(new MyObserver<ResponseBody>() {
                    @Override
                    public void onSuccess(ResponseBody responseBody) {
                        try {
                            JSONObject jsonObject = new JSONObject(responseBody.string());
                            JSONArray jsonArray = jsonObject.getJSONArray("rows");
                            onlineDataView.showData(jsonArray);
//                            JSONObject jsonObject = new JSONObject(responseBody.toString());
//                            JSONObject jsonObject = new JSONObject(testWater);
//                            DataWaterInfo dataWaterInfo = new Gson().fromJson(testWater,new TypeToken<DataWaterInfo>(){}.getType());
//                            onlineDataView.showWaterData(dataWaterInfo);
                        } catch (Exception e) {
                            e.printStackTrace();
                        }
                    }

                    @Override
                    public void onFail(Throwable e) {

                    }
                });
    }


}

